app/controllers/stores_controller.rb

  def index
    @stores = Store.all
---
SELECT "stores".* FROM "stores"